benchmark_results_replicated/20260803_085536/analysis/rep16/run/rust_heavy_c10/wrk_output.txt
Running 1m test @ http://localhost:8081/days-since-heavy
  4 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.93ms  599.35us   5.56ms   84.59%
    Req/Sec     2.24k   236.10     3.11k    75.58%
  Latency Distribution
     50%  684.00us
     75%    0.89ms
     90%    2.03ms
     99%    2.83ms
  533888 requests in 1.00m, 73.23MB read
Requests/sec:   8896.11
Transfer/sec:      1.22MB
P95: 2372
P99: 2831